cfd/OpenFOAM/incompressible/simpleFoam/validation/NACA0012/0.orig/include/boundaryConditions
// boundary conditions
flowVelocity   30.0;        // [m/s] flow velocity (Re=2.0e6)
pressure        0.0;        // [m^2/s^2] kinematic pressure (p/rho)

turbulentKE    1.35e-1;     // [m^2/s^2] turbulent kinetic energy k=(3/2)*(u_ref*T_i)^2
turbulentOmega 3.67;        // [1/s] specific turbulence dissipation rate
turbulentVisc  0.0;         // [m^2/s] turbulent eddy viscosity
